#ДЗ на понедельник:
# 1. Пользователь вводит год. Определить, является ли он високосным
# Если год делится на 4 без остатка - он високсоный
# Но! Если год делится на 4 и на 100 - он не високосный
# Но! Если год делится на 4 на 100 и на 400 - он високосный
god = 2000
if god % 400 == 0:
    print('Год високосный')
elif god % 100 == 0:
    print('Год не високосный')
elif go
p



# 2. Определить, существует ли треугольник с заданными сторонами
# Если каждая сторона меньше суммы других, то треугольник существует


